In [1]:
import pandas as pd

In [2]:
coffee = pd.read_csv("./warmup-data/coffee.csv")
results = pd.read_parquet("./data/results.parquet")
bios = pd.read_csv("./data/bios.csv")

In [3]:
coffee.sample(10)

          Day Coffee Type  Units Sold
3     Tuesday       Latte          20
11   Saturday       Latte          35
12     Sunday    Espresso          45
5   Wednesday       Latte          25
7    Thursday       Latte          30
13     Sunday       Latte          35
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
1      Monday       Latte          15
10   Saturday    Espresso          45

In [4]:
coffee.loc[0:5, "Coffee Type"]

0    Espresso
1       Latte
2    Espresso
3       Latte
4    Espresso
5       Latte
Name: Coffee Type, dtype: object

In [5]:
coffee.iloc[0:5, 1]

0    Espresso
1       Latte
2    Espresso
3       Latte
4    Espresso
Name: Coffee Type, dtype: object

In [6]:
coffee.loc[1, "Coffee Type"] = "Americano"
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday   Americano          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [7]:
coffee.sort_values("Units Sold", ascending=False)

          Day Coffee Type  Units Sold
8      Friday    Espresso          45
10   Saturday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday   Americano          15

In [8]:
coffee.sort_values(["Day", "Coffee Type", "Units Sold"], ascending=[1,0,1])

          Day Coffee Type  Units Sold
9      Friday       Latte          35
8      Friday    Espresso          45
0      Monday    Espresso          25
1      Monday   Americano          15
11   Saturday       Latte          35
10   Saturday    Espresso          45
13     Sunday       Latte          35
12     Sunday    Espresso          45
7    Thursday       Latte          30
6    Thursday    Espresso          40
3     Tuesday       Latte          20
2     Tuesday    Espresso          30
5   Wednesday       Latte          25
4   Wednesday    Espresso          35

### Filtering Data

getting olympic athletes whose height is above 215cm and when they have died

In [9]:
bios.loc[bios["height_cm"]>215, ["born_country"]]

       born_country
5089            RUS
5583            BRA
5673            GER
5716            GER
5781            USA
5796            AUS
6223            DEN
6270            NaN
6409            NaN
6420            LAT
6504            AUS
6722            USA
6937            USA
6978            LTU
7074            BRA
7188            RUS
7281            CRO
7376            LTU
52608           RUS
82100           FRA
89070           CHN
89075           ESP
107408          PUR
112312          BIH
112332          GRE
112337          IRI
118663          NaN
118676          UKR
120266          CHN
121694          TUN
123850          USA
130460          CHN
130461          CHN
138671          CZE
139365          FRA

getting athletes whose height is less than or equal to 175cm and belong to america

In [10]:
bios.loc[(bios["height_cm"] <= 175) & (bios["born_country"] == "USA")]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
960,964,Xóchitl Escobedo,1968-09-17,West Covina,California,USA,Mexico,170.0,60.0,NaN
961,965,Angélica Gavaldón,1973-10-03,El Centro,California,USA,Mexico,160.0,54.0,NaN
1345,1352,Laura Berg,1975-01-06,Santa Fe Springs,California,USA,United States,168.0,61.0,NaN
1346,1353,Gillian Boxx,1973-09-01,Fontana,California,USA,United States,170.0,NaN,NaN
1356,1363,Sheila Cornell-Douty,1962-02-26,Encino,California,USA,United States,175.0,81.0,NaN
...,...,...,...,...,...,...,...,...,...,...
144327,148015,Courtney Sarault,2000-04-24,Grand Rapids,Michigan,USA,Canada,174.0,NaN,NaN
144374,148064,Fei Anna,2000-10-13,Troy,Michigan,USA,People's Republic of China,169.0,62.0,NaN
144377,148067,Hu Baozhen,1994-09-24,Plymouth,Minnesota,USA,People's Republic of China,172.0,69.0,NaN
144383,148073,Lin Ni,1991-04-29,San José,California,USA,People's Republic of China,160.0,58.0,NaN
144388,148078,Zhang Xifang,2000-12-20,Commerce Township,Michigan,USA,People's Republic of China,165.0,63.0,NaN

getting athletes with a certain name

In [11]:
bios[bios["name"].str.contains("george|howard", case=False)] # we can use regex

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
80,81,George Caridia,1869-02-20,Kolkata (Calcutta),West Bengal,IND,Great Britain,NaN,NaN,1937-04-21
99,100,George Hillyard,1864-02-06,Hanwell,England,GBR,Great Britain,NaN,NaN,1943-03-24
115,116,George Simond,1867-01-23,Marylebone,England,GBR,Great Britain,NaN,NaN,1941-04-08
1168,1175,Howard Grant,1966-06-22,NaN,NaN,NaN,Canada,180.0,64.0,NaN
1206,1213,George Maughan,1910-05-08,Toronto,Ontario,CAN,Canada,NaN,NaN,2003-06-16
...,...,...,...,...,...,...,...,...,...,...
142197,145798,George Stanger,2000-08-15,Melrose,Scotland,GBR,New Zealand,NaN,NaN,NaN
142721,146340,George Ganea,1999-05-26,București (Bucharest),București,ROU,Romania,180.0,NaN,NaN
144108,147778,George Muir,1994-02-24,North Shore City,Auckland,NZL,New Zealand,171.0,NaN,NaN
145160,148877,George Marian Colțea,2000-05-17,NaN,NaN,NaN,Romania,NaN,NaN,NaN
145494,149221,George Wright,1890-07-21,Toronto,Ontario,CAN,Canada,183.0,NaN,1973-01-28

### Adding / Removing Columns

In [12]:
import numpy as np
import pandas as pd
coffee = pd.read_csv("./warmup-data/coffee.csv")

In [13]:
coffee["old_price"] = 4.99
coffee["new_price"] = np.where(coffee["Coffee Type"] == "Espresso", 3.99, 5.99)
coffee.head()

         Day Coffee Type  Units Sold  old_price  new_price
0     Monday    Espresso          25       4.99       3.99
1     Monday       Latte          15       4.99       5.99
2    Tuesday    Espresso          30       4.99       3.99
3    Tuesday       Latte          20       4.99       5.99
4  Wednesday    Espresso          35       4.99       3.99

we have 2 prices and i want to drop the old_price

In [14]:
coffee.drop(columns=["old_price"])

          Day Coffee Type  Units Sold  new_price
0      Monday    Espresso          25       3.99
1      Monday       Latte          15       5.99
2     Tuesday    Espresso          30       3.99
3     Tuesday       Latte          20       5.99
4   Wednesday    Espresso          35       3.99
5   Wednesday       Latte          25       5.99
6    Thursday    Espresso          40       3.99
7    Thursday       Latte          30       5.99
8      Friday    Espresso          45       3.99
9      Friday       Latte          35       5.99
10   Saturday    Espresso          45       3.99
11   Saturday       Latte          35       5.99
12     Sunday    Espresso          45       3.99
13     Sunday       Latte          35       5.99

convert datetime to datetime type

In [15]:
bios["born_datetime"] = pd.to_datetime(bios["born_date"])
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,born_datetime
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,1886-12-12
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,1969-04-01
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,1898-08-13
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,1895-05-11
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,1878-04-17

In [16]:
bios["born_year"] = bios["born_datetime"].dt.year
bios[["name", "born_year"]]

                         name  born_year
0       Jean-François Blanchy     1886.0
1              Arnaud Boetsch     1969.0
2                Jean Borotra     1898.0
3             Jacques Brugnon     1895.0
4                Albert Canet     1878.0
...                       ...        ...
145495      Polina Luchnikova     2002.0
145496    Valeriya Merkusheva     1999.0
145497        Yuliya Smirnova     1998.0
145498         André Foussard     1899.0
145499          Bill Phillips     1913.0

[145500 rows x 2 columns]

### Save to new csv file after changes

In [20]:
bios.to_csv("./data/bios_new.csv",index=False)

### Adding / Removing Columns

In [21]:
# categorizing athletes from short, average, and tall
bios["height_category"] = bios["height_cm"].apply(lambda x: 'Short' if x < 165 else ('Average' if x < 185 else 'Tall'))

In [22]:
bios

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,born_datetime,born_year,height_category
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02,1886-12-12,1886.0,Tall
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN,1969-04-01,1969.0,Average
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17,1898-08-13,1898.0,Average
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20,1895-05-11,1895.0,Average
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25,1878-04-17,1878.0,Tall
...,...,...,...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN,2002-01-30,2002.0,Average
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN,1999-09-20,1999.0,Average
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN,1998-05-08,1998.0,Short
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18,1899-05-19,1899.0,Average
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20,1913-07-15,1913.0,Tall